log/index.html
<!DOCTYPE html>
<html>
<head>
<title>bydriv.github.io/log</title>
<!-- 2018-08-31 Fri 17:05 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">bydriv.github.io/log</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<strong>log</strong>/
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-07-07">2018-07-07</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-08-31">2018-08-31</time>
</p>

</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Queue <code>[15/15]</code></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>[X]</code> シャンティで遊ぶ (2018-07-01 .. 2018-07-02; Enqueued at 2018-07-01; Dequeued at 2018-07-02)
</li>
<li><code>[X]</code> 七夕絵を描く (2018-07-02 .. 2018-07-06; Enqueued at 2018-07-02; Dequeued at 2018-07-06)
</li>
<li><code>[X]</code> スニーカーサンダル絵を描く (2018-07-08 .. 2018-07-11; Enqueued at 2018-07-07; Dequeued at 2018-07-11)
</li>
<li><code>[X]</code> Lamb の実装 (2018-07-18 .. 2018-08-04; Enqueued at 2018-07-18; Dequeued at 2018-08-04)
</li>
<li><code>[X]</code> <a href="./../novel/breath.html">呼吸/Breath</a> (2018-08-06 .. 2018-08-06; Enqueued at 2018-08-06; Dequeued at 2018-08-06)
</li>
<li><code>[X]</code> <a href="./../novel/ava-light.html">アヴァ・ライト/Ava Light</a> (2018-08-06 .. 2018-08-06; Enqueued at 2018-08-06; Dequeued at 2018-08-06)
</li>
<li><code>[X]</code> <a href="./../novel/ideal-pilot.html">地獄の水先案内人/Ideal Pilot</a> (2018-08-07 .. 2018-08-07; Enqueued at 2018-08-07; Dequeued at 2018-08-07)
</li>
<li><code>[X]</code> <a href="./../novel/ghost-in-the-machine.html">こころ/Ghost in the Machine</a> (2018-08-07 .. 2018-08-07; Enqueued at 2018-08-07; Dequeued at 2018-08-07)
</li>
<li><code>[X]</code> <a href="./../novel/vixen-sniper.html">妖狐の狙撃手/Vixen Sniper</a> (2018-08-16 .. 2018-08-22; Enqueued at 2018-08-16; Dequeued at 2018-08-22)
</li>
<li><code>[X]</code> <a href="./../novel/self-existence-of-space.html">宇宙の自存性/Self-Existence of Space</a> (2018-08-23 .. 2018-08-23; Enqueued at 2018-08-23; Dequeued at 2018-08-23)
</li>
<li><code>[X]</code> <a href="./../novel/principles-of-formalspeak.html">フォーマルスピークの諸原理/Principles of Formalspeak</a> (2018-08-23 .. 2018-08-23; Enqueued at 2018-08-23; Dequeued at 2018-08-23)
</li>
<li><code>[X]</code> <a href="./../novel/2063-04-05.html">2063年4月5日/Apr. 5, 2063</a> (2018-08-25 .. 2018-08-25; Enqueued at 2018-08-25; Dequeued at 2018-08-25)
</li>
<li><code>[X]</code> <a href="./../novel/selective-and-transgenic.html">セレクティヴとトランスジェニック/Selective and Transgenic</a> (2018-08-27 .. 2018-08-27; Enqueued at 2018-08-27; Dequeued at 2018-08-27)
</li>
<li><code>[X]</code> <a href="./../novel/cotard-delusion.html">コタール症候群/Cotard Delusion</a> (2018-08-27 .. 2018-08-27; Enqueued at 2018-08-27; Dequeued at 2018-08-27)
</li>
<li><code>[X]</code> <a href="./../novel/information.html">情報/Information</a> (2018-08-30 .. 2018-08-30; Enqueued at 2018-08-30; Dequeued at 2018-08-30)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2018</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">2018-07</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">2018-07-01 .. 2018-07-02</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>シャンティで遊んだ．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">2018-07-02 .. 2018-07-06</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>七夕絵を描いた．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">2018-07-07 .. 2018-07-08</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>休養．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4">2018-07-09 .. 2018-07-11</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>スニーカーサンダル絵を描いた．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5">2018-07-12 .. 2018-07-13</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>マイクラやってた
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6">2018-07-14 .. 2018-07-18</h4>
<div class="outline-text-4" id="text-2-1-6">
<ul class="org-ul">
<li>なんか典のあれこれをやってた．
</li>
<li>ラムダ計算入門のつづき書いたり，形式化しようとしてみたり，
Haskell 2020 斜め読みみたいな本を書こうとしたり，
計算量の本を書こうとしたり， MHC 本を書こうとしたり．
ランク2型本書こうとしたり，型推論本書こうとしたり，
結局，どれもうまくいかなかった．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7">2018-07-18 .. 2018-07-19</h4>
<div class="outline-text-4" id="text-2-1-7">
<ul class="org-ul">
<li>ラムダ計算実装本の原稿がひとまずできた．あとで推敲はする．
</li>
<li>典に応募した．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-8" class="outline-4">
<h4 id="sec-2-1-8">2018-07-20 .. 2018-07-22</h4>
<div class="outline-text-4" id="text-2-1-8">
<ul class="org-ul">
<li>ラムダ計算実装本の実装を進めた
</li>
<li>x86 生成部分ができた
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-9" class="outline-4">
<h4 id="sec-2-1-9">2018-07-23 .. 2018-07-23</h4>
<div class="outline-text-4" id="text-2-1-9">
<ul class="org-ul">
<li>MS の ABI に対応し， EXE 生成部分ができた
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-10" class="outline-4">
<h4 id="sec-2-1-10">2018-07-24 .. 2018-07-26</h4>
<div class="outline-text-4" id="text-2-1-10">
<ul class="org-ul">
<li>実装の続き
</li>
<li>2018-07-26: GC が実装できた
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-11" class="outline-4">
<h4 id="sec-2-1-11">2018-07-27 .. 2018-07-27</h4>
<div class="outline-text-4" id="text-2-1-11">
<ul class="org-ul">
<li>実装の続き
</li>
<li>2018-07-27: パーサができた
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-12" class="outline-4">
<h4 id="sec-2-1-12">2018-07-28 .. 2018-07-30</h4>
<div class="outline-text-4" id="text-2-1-12">
<ul class="org-ul">
<li>実装の続き
</li>
<li>エラーメッセージの改善など、細かいこと
</li>
<li>くわしくはコミットログを読んで
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-13" class="outline-4">
<h4 id="sec-2-1-13">2018-07-31 .. 2018-07-31</h4>
<div class="outline-text-4" id="text-2-1-13">
<ul class="org-ul">
<li>GC のデバッグなど
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">2018-08</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">2018-08-01 .. 2018-08-04</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>実装の続き
</li>
<li>bin8 などの実装
</li>
<li>2018-08-03: FFI, 分割コンパイルの実装
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">2018-08-05 .. 2018-08-05</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>Lamb 機能追加， デバッグ， リファクタリングなど
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">2018-08-06 .. 2018-08-06</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li><a href="./breath.html">呼吸/Breath</a>
</li>
<li><a href="./ava-light.html">アヴァ・ライト/Ava Light</a>
</li>
<li>Lamb 機能追加， デバッグ， リファクタリングなど
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">2018-08-07 .. 2018-08-07</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li><a href="./../novel/ideal-pilot.html">地獄の水先案内人/Ideal Pilot</a>
</li>
<li><a href="./../novel/ghost-in-the-machine.html">こころ/Ghost in the Machine</a>
</li>
<li>Lamb 機能追加， デバッグ， リファクタリングなど
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">2018-08-08 .. 2018-08-14</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>Lamb 機能追加， デバッグ， リファクタリングなど
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">2018-08-14 .. 2018-08-16</h4>
<div class="outline-text-4" id="text-2-2-6">
<ul class="org-ul">
<li>React でブラックジャックを実装してた
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-7" class="outline-4">
<h4 id="sec-2-2-7">2018-08-16 .. 2018-08-22</h4>
<div class="outline-text-4" id="text-2-2-7">
<ul class="org-ul">
<li><a href="./../novel/vixen-sniper.html">妖狐の狙撃手/Vixen Sniper</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-8" class="outline-4">
<h4 id="sec-2-2-8">2018-08-23 .. 2018-08-27</h4>
<div class="outline-text-4" id="text-2-2-8">
<ul class="org-ul">
<li><a href="./../novel/self-existence-of-space.html">宇宙の自存性/Self-Existence of Space</a>
</li>
<li><a href="./../novel/principles-of-formalspeak.html">フォーマルスピークの諸原理/Principles of Formalspeak</a>
</li>
<li><a href="./../novel/2063-04-05.html">2063年4月5日/Apr. 5, 2063</a>
</li>
<li><a href="./../novel/selective-and-transgenic.html">セレクティヴとトランスジェニック/Selective and Transgenic</a>
</li>
<li><a href="./../novel/cotard-delusion.html">コタール症候群/Cotard Delusion</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-9" class="outline-4">
<h4 id="sec-2-2-9">2018-08-28 .. 2018-08-29</h4>
<div class="outline-text-4" id="text-2-2-9">
<ul class="org-ul">
<li>Lamb に継続を実装．
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2-10" class="outline-4">
<h4 id="sec-2-2-10">2018-08-30 .. 2018-08-30</h4>
<div class="outline-text-4" id="text-2-2-10">
<ul class="org-ul">
<li><a href="./../novel/information.html">情報/Information</a>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">License</h2>
<div class="outline-text-2" id="text-3">
<p>
GPLv3.
</p>
</div>
</div>
</div>
</body>
</html>
